import time

import os

import pyglet 
from pytubefix import YouTube

songplayed = 1

DOGMATICAbeatsync_first = 0
DOGMATICAbeatsync_second = 0

DOGMATICAlyricnum = 0

BE_AMCSLASH = ["    \n",                     #0
               "    \n",                     #1
               "    \n",                     #2
               "    .s5SSSs.  .s5SSSs.  \n", #3
               "          SS.       SS. \n", #4
               "    sS    S%S sS    `:; \n", #5
               "    SS    S%S SS        \n", #6
               "    SS .sSSS  SSSs.     \n", #7
               "    SS    S%S SS        \n", #8
               "    SS    `:; SS        \n", #9
               "    SS    ;,. SS    ;,. \n", #10
               "    `:;;;;;:' `:;;;;;:' \n", #11
               "    \n",                     #12
               "    \n",                     #13
               "    \n",]                    #14

BE_AMCAAA01 = ["     .S_SSSs      sSSs  \n", #0
               "    .SS~SSSSS    d%%SP  \n", #1
               "    S%S   SSSS  d%S'    \n", #2
               "    S%S    S%S  S%S     \n", #3
               "    S%S SSSS%P  S&S     \n", #4
               "    S&S  SSSY   S&S_Ss  \n", #5
               "    S&S    S&S  S&S~SP  \n", #6
               "    S&S    S&S  S&S~SP  \n", #7
               "    S&S    S&S  S&S     \n", #8
               "    S*S    S&S  S*b     \n", #9
               "    S*S    S*S  S*S.    \n", #10
               "    S*S SSSSP    SSSbs  \n", #11
               "    S*S  SSY      YSSP  \n", #12
               "    SP                  \n", #13
               "    Y                   \n",]#14

KEEP_AMCAAA01 = ["     .S    S.     sSSs    sSSs   .S_sSSs    \n", #0                 
                 "    .SS    SS.   d%%SP   d%%SP  .SS~YS%%b   \n", #1
                 "    S%S    S&S  d%S'    d%S'    S%S   `S%b  \n", #2
                 "    S%S    d*S  S%S     S%S     S%S    S%S  \n", #3
                 "    S&S   .S*S  S&S     S&S     S%S    d*S  \n", #4
                 "    S&S_sdSSS   S&S_Ss  S&S_Ss  S&S   .S*S  \n", #5
                 "    S&S~YSSY%b  S&S~SP  S&S~SP  S&S_sdSSS   \n", #6
                 "    S&S    `S%  S&S     S&S     S&S~YSSY    \n", #7
                 "    S*S     S%  S*b     S*b     S*S         \n", #8
                 "    S*S     S&  S*S.    S*S.    S*S         \n", #9
                 "    S*S     S&   SSSbs   SSSbs  S*S         \n", #10
                 "    S*S     SS    YSSP    YSSP  S*S         \n", #11
                 "    SP                          SP          \n", #12
                 "    Y                           Y           \n",]#13

BEFORE_BLURVISIONASCII = [
    "░▒▓███████▓▒░░▒▓████████▓▒░▒▓████████▓▒░▒▓██████▓▒░░▒▓███████▓▒░░▒▓████████▓▒░ \n", #0
    "░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░      ░▒▓█▓▒░     ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░        \n", #1
    "░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░      ░▒▓█▓▒░     ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░        \n", #2
    "░▒▓███████▓▒░░▒▓██████▓▒░ ░▒▓██████▓▒░░▒▓█▓▒░░▒▓█▓▒░▒▓███████▓▒░░▒▓██████▓▒░   \n", #3
    "░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░      ░▒▓█▓▒░     ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░        \n", #4
    "░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░      ░▒▓█▓▒░     ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░        \n", #5
    "░▒▓███████▓▒░░▒▓████████▓▒░▒▓█▓▒░      ░▒▓██████▓▒░░▒▓█▓▒░░▒▓█▓▒░▒▓████████▓▒░ \n", #6
]

OH_ANSIREGULAR = [
    "     ██████  ██   ██ \n", #0
    "    ██    ██ ██   ██ \n", #1
    "    ██    ██ ███████ \n", #2
    "    ██    ██ ██   ██ \n", #3
    "     ██████  ██   ██ \n", #4
]
MY_ANSIREGULAR = [
    "    ███    ███ ██    ██ \n", #0
    "    ████  ████  ██  ██  \n", #1
    "    ██ ████ ██   ████   \n", #2
    "    ██  ██  ██    ██    \n", #3
    "    ██      ██    ██    \n", #4
]
GOD_ANSIREGULAR = [
    "     ██████   ██████  ██████  \n", #0
    "    ██       ██    ██ ██   ██ \n", #1
    "    ██   ███ ██    ██ ██   ██ \n", #2
    "    ██    ██ ██    ██ ██   ██ \n", #3
    "     ██████   ██████  ██████  \n", #4
]
SHUT_THEEDGE = [
    "       ▄▄▄▄▄    ▄  █   ▄     ▄▄▄▄▀ \n", #0
    "      █     ▀▄ █   █    █ ▀▀▀ █    \n", #1
    "    ▄  ▀▀▀▀▄   ██▀▀█ █   █    █    \n", #2
    "     ▀▄▄▄▄▀    █   █ █   █   █     \n", #3
    "                  █  █▄ ▄█  ▀      \n", #4
    "                 ▀    ▀▀▀          \n", #5
]
THE_THIS = [
    "     ▄▀▀▀█▀▀▄  ▄▀▀▄ ▄▄   ▄▀▀█▄▄▄▄ \n", #0
    "    █    █  ▐ █  █   ▄▀ ▐  ▄▀   ▐ \n", #1
    "    ▐   █     ▐  █▄▄▄█    █▄▄▄▄▄  \n", #2
    "       █         █   █    █    ▌  \n", #3
    "     ▄▀         ▄▀  ▄▀   ▄▀▄▄▄▄   \n", #4
    "    █          █   █     █    ▐   \n", #5
    "    ▐          ▐   ▐     ▐        \n", #6
]
FUCK_THIS = [
    "     ▄▀▀▀█▄    ▄▀▀▄ ▄▀▀▄  ▄▀▄▄▄▄   ▄▀▀▄ █ \n", #0
    "    █  ▄▀  ▀▄ █   █    █ █ █    ▌ █  █ ▄▀ \n", #1
    "    ▐ █▄▄▄▄   ▐  █    █  ▐ █      ▐  █▀▄  \n", #2
    "     █    ▐     █    █     █        █   █ \n", #3
    "     █           ▀▄▄▄▄▀   ▄▀▄▄▄▄▀ ▄▀   █  \n", #4
    "    █                    █     ▐  █    ▐  \n", #5
    "    ▐                    ▐        ▐       \n", #6
]
UP_BLOODY = [
    "     █    ██  ██▓███   ▐██▌ \n", #0
    "     ██  ▓██▒▓██░  ██▒ ▐██▌ \n", #1
    "    ▓██  ▒██░▓██░ ██▓▒ ▐██▌ \n", #2
    "    ▓▓█  ░██░▒██▄█▓▒ ▒ ▓██▒ \n", #3
    "    ▒▒█████▓ ▒██▒ ░  ░ ▒▄▄  \n", #4
    "    ░▒▓▒ ▒ ▒ ▒▓▒░ ░  ░ ░▀▀▒ \n", #5
    "    ░░▒░ ░ ░ ░▒ ░      ░  ░ \n", #6
    "     ░░░ ░ ░ ░░           ░ \n", #7
    "       ░               ░    \n", #8
]
TWICE_BLOODY = [
    "▄▄▄█████▓ █     █░ ██▓ ▄████▄  ▓█████ \n", #0
    "▓  ██▒ ▓▒▓█░ █ ░█░▓██▒▒██▀ ▀█  ▓█   ▀ \n", #1
    "▒ ▓██░ ▒░▒█░ █ ░█ ▒██▒▒▓█    ▄ ▒███   \n", #2
    "░ ▓██▓ ░ ░█░ █ ░█ ░██░▒▓▓▄ ▄██▒▒▓█  ▄ \n", #3
    "  ▒██▒ ░ ░░██▒██▓ ░██░▒ ▓███▀ ░░▒████▒\n", #4
    "  ▒ ░░   ░ ▓░▒ ▒  ░▓  ░ ░▒ ▒  ░░░ ▒░ ░\n", #5
    "  ▒ ░░   ░ ▓░▒ ▒  ░▓  ░ ░▒ ▒  ░░░ ▒░ ░\n", #6
    "    ░      ▒ ░ ░   ▒ ░  ░  ▒    ░ ░  ░\n", #7
    "  ░        ░   ░   ▒ ░░           ░   \n", #8
    "             ░     ░  ░ ░         ░  ░\n", #9
    "                      ░               \n", #10
]
TONIGHT_BLOODY = [
    "▄▄▄█████▓ ▒█████   ███▄    █  ██▓  ▄████  ██░ ██ ▄▄▄█████▓\n", #0
    "▓  ██▒ ▓▒▒██▒  ██▒ ██ ▀█   █ ▓██▒ ██▒ ▀█▒▓██░ ██▒▓  ██▒ ▓▒\n", #1
    "▒ ▓██░ ▒░▒██░  ██▒▓██  ▀█ ██▒▒██▒▒██░▄▄▄░▒██▀▀██░▒ ▓██░ ▒░\n", #2
    "░ ▓██▓ ░ ▒██   ██░▓██▒  ▐▌██▒░██░░▓█  ██▓░▓█ ░██ ░ ▓██▓ ░ \n", #3
    "  ▒██▒ ░ ░ ████▓▒░▒██░   ▓██░░██░░▒▓███▀▒░▓█▒░██▓  ▒██▒ ░ \n", #4
    "  ▒ ░░   ░ ▒░▒░▒░ ░ ▒░   ▒ ▒ ░▓   ░▒   ▒  ▒ ░░▒░▒  ▒ ░░   \n", #5
    "    ░      ░ ▒ ▒░ ░ ░░   ░ ▒░ ▒ ░  ░   ░  ▒ ░▒░ ░    ░    \n", #6
    "  ░      ░ ░ ░ ▒     ░   ░ ░  ▒ ░░ ░   ░  ░  ░░ ░  ░      \n", #7
    "             ░ ░           ░  ░        ░  ░  ░  ░         \n", #8
]
SO_THEEDGE = [
    "   ▄▄▄▄▄   ████▄\n", #0
    "  █     ▀▄ █   █\n", #1
    "▄  ▀▀▀▀▄   █   █\n", #2
    " ▀▄▄▄▄▀    ▀████\n", #3
    "                \n", #4
    "                \n", #5
    "                \n", #6
]
PLEASE_THEEDGE = [
    "█ ▄▄  █     ▄███▄   ██      ▄▄▄▄▄   ▄███▄  \n", #0
    "█   █ █     █▀   ▀  █ █    █     ▀▄ █▀   ▀ \n", #1
    "█▀▀▀  █     ██▄▄    █▄▄█ ▄  ▀▀▀▀▄   ██▄▄   \n", #2
    "█     ███▄  █▄   ▄▀ █  █  ▀▄▄▄▄▀    █▄   ▄▀\n", #3
    " █        ▀ ▀███▀      █            ▀███▀  \n", #4
    "  ▀                   █                    \n", #5
    "                     ▀                     \n", #6
]
JUST_THEEDGE = [
    "  ▄▄▄▄▄ ▄      ▄▄▄▄▄      ▄▄▄▄▀\n", #0
    "▄▀  █    █    █     ▀▄ ▀▀▀ █   \n", #1
    "    █ █   █ ▄  ▀▀▀▀▄       █   \n", #2
    " ▄ █  █   █  ▀▄▄▄▄▀       █    \n", #3
    "  ▀   █▄ ▄█              ▀     \n", #4
    "       ▀▀▀                     \n", #5
    "                               \n", #6
]
HOLD_THEEDGE = [
    " ▄  █ ████▄ █     ██▄  \n", #0
    "█   █ █   █ █     █  █ \n", #1
    "██▀▀█ █   █ █     █   █\n", #2
    "█   █ ▀████ ███▄  █  █ \n", #3
    "   █            ▀ ███▀ \n", #4
    "  ▀                    \n", #5
    "                       \n", #6
]
ME_THEEDGE = [
    "█▀▄▀█ ▄███▄  \n", #0
    "█ █ █ █▀   ▀ \n", #1
    "█ ▄ █ ██▄▄   \n", #2
    "█   █ █▄   ▄▀\n", #3
    "   █  ▀███▀  \n", #4
    "  ▀          \n", #5
    "             \n", #6
]
ONE_THEEDGE = [
    "████▄    ▄   ▄███▄  \n", #0
    "█   █     █  █▀   ▀ \n", #1
    "█   █ ██   █ ██▄▄   \n", #2
    "▀████ █ █  █ █▄   ▄▀\n", #3
    "      █  █ █ ▀███▀  \n", #4
    "      █   ██        \n", #5
    "                    \n", #6
]
LAST_THEEDGE = [
    "█    ██      ▄▄▄▄▄      ▄▄▄▄▀ \n", #0
    "█    █ █    █     ▀▄ ▀▀▀ █    \n", #1
    "█    █▄▄█ ▄  ▀▀▀▀▄       █    \n", #2
    "███▄ █  █  ▀▄▄▄▄▀       █     \n", #3
    "    ▀   █              ▀      \n", #4
    "       █                      \n", #5
    "      ▀                       \n", #6
]
TIME_BLOODY = [
    "▄▄▄█████▓ ██▓ ███▄ ▄███▓▓█████ \n", #0
    "▓  ██▒ ▓▒▓██▒▓██▒▀█▀ ██▒▓█   ▀ \n", #1
    "▒ ▓██░ ▒░▒██▒▓██    ▓██░▒███   \n", #2
    "░ ▓██▓ ░ ░██░▒██    ▒██ ▒▓█  ▄ \n", #3
    "  ▒██▒ ░ ░██░▒██▒   ░██▒░▒████▒\n", #4
    "  ▒ ░░   ░▓  ░ ▒░   ░  ░░░ ▒░ ░\n", #5
    "    ░     ▒ ░░  ░      ░ ░ ░  ░\n", #6
    "  ░       ▒ ░░      ░      ░   \n", #7
    "          ░         ░      ░  ░\n", #8
]
GOODBYE_BLOODY = [
    "  ▄████  ▒█████   ▒█████  ▓█████▄  ▄▄▄▄ ▓██   ██▓▓█████ \n", #0
    " ██▒ ▀█▒▒██▒  ██▒▒██▒  ██▒▒██▀ ██▌▓█████▄▒██  ██▒▓█   ▀ \n", #1
    "▒██░▄▄▄░▒██░  ██▒▒██░  ██▒░██   █▌▒██▒ ▄██▒██ ██░▒███   \n", #2
    "░▓█  ██▓▒██   ██░▒██   ██░░▓█▄   ▌▒██░█▀  ░ ▐██▓░▒▓█  ▄ \n", #3
    "░▒▓███▀▒░ ████▓▒░░ ████▓▒░░▒████▓ ░▓█  ▀█▓░ ██▒▓░░▒████▒\n", #4
    " ░▒   ▒ ░ ▒░▒░▒░ ░ ▒░▒░▒░  ▒▒▓  ▒ ░▒▓███▀▒ ██▒▒▒ ░░ ▒░ ░\n", #5
    "  ░   ░   ░ ▒ ▒░   ░ ▒ ▒░  ░ ▒  ▒ ▒░▒   ░▓██ ░▒░  ░ ░  ░\n", #6
    "░ ░   ░ ░ ░ ░ ▒  ░ ░ ░ ▒   ░ ░  ░  ░    ░▒ ▒ ░░     ░   \n", #7
    "      ░     ░ ░      ░ ░     ░     ░     ░ ░        ░  ░\n", #8
    "                           ░            ░░ ░            \n", #9
]
AAH_BLOODY = [
    " ▄▄▄      ▄▄▄       ██░ ██  ▐██▌ \n", #0
    "▒████▄   ▒████▄    ▓██░ ██▒ ▐██▌ \n", #1
    "▒██  ▀█▄ ▒██  ▀█▄  ▒██▀▀██░ ▐██▌ \n", #2
    "░██▄▄▄▄██░██▄▄▄▄██ ░▓█ ░██  ▓██▒ \n", #3
    " ▓█   ▓██▒▓█   ▓██▒░▓█▒░██▓ ▒▄▄  \n", #4
    " ▒▒   ▓▒█░▒▒   ▓▒█░ ▒ ░░▒░▒ ░▀▀▒ \n", #5
    "  ░   ▒    ░   ▒    ░  ░░ ░    ░ \n", #6
    "      ░  ░     ░  ░ ░  ░  ░ ░    \n", #7
]
AAH_BLOODY_LEN = len(AAH_BLOODY[0])
































I_BIG = [
    "     _____      \n", #0
    "    |_   _|     \n", #1
    "      | |______ \n", #2
    "      | |______|\n", #3
    "     _| |_      \n", #4
    "    |_____|     \n", #5
]
DONT_BIG = [
    "     _____   ____  _   _ _______     \n", #0
    "    |  __ \\ / __ \\| \\ | |__   __|    \n", #1
    "    | |  | | |  | |  \\| |  | |______ \n", #2
    "    | |  | | |  | | . ` |  | |______|\n", #3
    "    | |__| | |__| | |\\  |  | |       \n", #4
    "    |_____/ \\____/|_| \\_|  |_|       \n", #5
]
HAVE_BIG = [
    "     _    _     __      ________      \n", #0
    "    | |  | |   /\\ \\    / /  ____|     \n", #1
    "    | |__| |  /  \\ \\  / /| |__ ______ \n", #2
    "    |  __  | / /\\ \\ \\/ / |  __|______|\n", #3
    "    | |  | |/ ____ \\  /  | |____      \n", #4
    "    |_|  |_/_/    \\_\\/   |______|     \n", #5
]
A_BIG = [
    "                   \n", #0
    "        /\\         \n", #1
    "       /  \\ ______ \n", #2
    "      / /\\ \\______|\n", #3
    "     / ____ \\      \n", #4
    "    /_/    \\_\\     \n", #5
]





I_SBLOOD = [
    "    @@@         \n", #0
    "    @@!         \n", #1
    "    !!@ @!@!@!@!\n", #2
    "    !!:         \n", #3
    "    :           \n", #4
]
DONT_SBLOOD = [
    "    @@@@@@@   @@@@@@  @@@  @@@ @@@@@@@         \n", #0
    "    @@!  @@@ @@!  @@@ @@!@!@@@   @@!           \n", #1
    "    @!@  !@! @!@  !@! @!@@!!@!   @!!   @!@!@!@!\n", #2
    "    !!:  !!! !!:  !!! !!:  !!!   !!:           \n", #3
    "    :: :  :   : :. :  ::    :     :            \n", #4
]
HAVE_SBLOOD = [
    "    @@@  @@@  @@@@@@  @@@  @@@ @@@@@@@@         \n", #0
    "    @@!  @@@ @@!  @@@ @@!  @@@ @@!              \n", #1
    "    @!@!@!@! @!@!@!@! @!@  !@! @!!!:!   @!@!@!@!\n", #2
    "    !!:  !!! !!:  !!!  !: .:!  !!:              \n", #3
    "     :   : :  :   : :    ::    : :: :::         \n", #4
]
A_SBLOOD = [
    "     @@@@@@          \n", #0
    "    @@!  @@@         \n", #1
    "    @!@!@!@! @!@!@!@!\n", #2
    "    !!:  !!!         \n", #3
    "     :   : :         \n", #4
]





I_ANSIREGULAR = [
    "    ██       \n", #0
    "    ██       \n", #1
    "    ██ █████ \n", #2
    "    ██       \n", #3
    "    ██       \n", #4
]
DONT_ANSIREGULAR = [
    "    ██████   ██████  ███    ██ ████████       \n", #0
    "    ██   ██ ██    ██ ████   ██    ██          \n", #1
    "    ██   ██ ██    ██ ██ ██  ██    ██    █████ \n", #2
    "    ██   ██ ██    ██ ██  ██ ██    ██          \n", #3
    "    ██████   ██████  ██   ████    ██          \n", #4
]
HAVE_ANSIREGULAR = [
    "    ██   ██  █████  ██    ██ ███████       \n", #0
    "    ██   ██ ██   ██ ██    ██ ██            \n", #1
    "    ███████ ███████ ██    ██ █████   █████ \n", #2
    "    ██   ██ ██   ██  ██  ██  ██            \n", #3
    "    ██   ██ ██   ██   ████   ███████       \n", #4
]
A_ANSIREGULAR = [
    "     █████        \n", #0
    "    ██   ██       \n", #1
    "    ███████ █████ \n", #2
    "    ██   ██       \n", #3
    "    ██   ██       \n", #4
]





I_THEEDGE = [
    "    ▄█ \n", #0
    "    ██ \n", #1
    "    ██ \n", #2
    "    ▐█ \n", #3
    "     ▐ \n", #4
    "\n",        #5
    "\n",        #6
]
DONT_THEEDGE = [
    "    ██▄   ████▄    ▄     ▄▄▄▄▀ \n", #0
    "    █  █  █   █     █ ▀▀▀ █    \n", #1
    "    █   █ █   █ ██   █    █    \n", #2
    "    █  █  ▀████ █ █  █   █     \n", #3
    "    ███▀        █  █ █  ▀      \n", #4
    "                █   ██         \n", #5
    "\n",                                #6
]
HAVE_THEEDGE = [
    "     ▄  █ ██       ▄   ▄███▄   \n", #0
    "    █   █ █ █       █  █▀   ▀  \n", #1
    "    ██▀▀█ █▄▄█ █     █ ██▄▄    \n", #2
    "    █   █ █  █  █    █ █▄   ▄▀ \n", #3
    "       █     █   █  █  ▀███▀   \n", #4
    "      ▀     █     █▐           \n", #5
    "           ▀      ▐            \n", #6
]
A_THEEDGE = [
    "    ██   \n", #0
    "    █ █  \n", #1
    "    █▄▄█ \n", #2
    "    █  █ \n", #3
    "       █ \n", #4
    "      █  \n", #5
    "     ▀   \n", #6
]





I_AMCSlash = [
    "    s.  \n", #0
    "    SS. \n", #1
    "    S%S \n", #2
    "    S%S \n", #3
    "    S%S \n", #4
    "    S%S \n", #5
    "    `:; \n", #6
    "    ;,. \n", #7
    "    ;:' \n", #8
]
DONT_AMCSlash = [
    "    .s5SSSs.  .s5SSSs.  .s    s.  .s5SSSSs. \n", #0
    "          SS.       SS.       SS.    SSS    \n", #1
    "    sS    S%S sS    S%S sSs.  S%S    S%S    \n", #2
    "    SS    S%S SS    S%S SS`S. S%S    S%S    \n", #3
    "    SS    S%S SS    S%S SS `S.S%S    S%S    \n", #4
    "    SS    S%S SS    S%S SS  `sS%S    S%S    \n", #5
    "    SS    `:; SS    `:; SS    `:;    `:;    \n", #6
    "    SS    ;,. SS    ;,. SS    ;,.    ;,.    \n", #7
    "    ;;;;;;;:' `:;;;;;:' :;    ;:'    ;:'    \n", #8
]
HAVE_AMCSlash = [
    "    .s    s.  .s5SSSs.  .s    s.  .s5SSSs.  \n", #0
    "          SS.       SS.       SS.       SS. \n", #1
    "    sS    S%S sS    S%S sS    S%S sS    `:; \n", #2
    "    SS    S%S SS    S%S SS    S%S SS        \n", #3
    "    SSSs. S%S SSSs. S%S SS    S%S SSSs.     \n", #4
    "    SS    S%S SS    S%S  SS   S%S SS        \n", #5
    "    SS    `:; SS    `:;  SS   `:; SS        \n", #6
    "    SS    ;,. SS    ;,.   SS  ;,. SS    ;,. \n", #7
    "    :;    ;:' :;    ;:'    `:;;:' `:;;;;;:' \n", #8
]
A_AMCSlash = [
    "    .s5SSSs.  \n", #0
    "          SS. \n", #1
    "    sS    S%S \n", #2
    "    SS    S%S \n", #3
    "    SSSs. S%S \n", #4
    "    SS    S%S \n", #5
    "    SS    `:; \n", #6
    "    SS    ;,. \n", #7
    "    :;    ;:' \n", #8
]





I_DeltaCorpsPriest1 = [
    "     ▄█  \n", #0
    "    ███  \n", #1
    "    ███▌ \n", #2
    "    ███▌ \n", #3
    "    ███▌ \n", #4
    "    ███  \n", #5
    "    ███  \n", #6
    "    █▀   \n", #7
]
DONT_DeltaCorpsPriest1 = [
    "    ████████▄   ▄██████▄  ███▄▄▄▄       ███     \n", #0
    "    ███   ▀███ ███    ███ ███▀▀▀██▄ ▀█████████▄ \n", #1
    "    ███    ███ ███    ███ ███   ███    ▀███▀▀██ \n", #2
    "    ███    ███ ███    ███ ███   ███     ███   ▀ \n", #3
    "    ███    ███ ███    ███ ███   ███     ███     \n", #4
    "    ███    ███ ███    ███ ███   ███     ███     \n", #5
    "    ███   ▄███ ███    ███ ███   ███     ███     \n", #6
    "    ████████▀   ▀██████▀   ▀█   █▀     ▄████▀   \n", #7
]
HAVE_DeltaCorpsPriest1 = [
    "       ▄█    █▄       ▄████████  ▄█    █▄     ▄████████ \n", #0
    "      ███    ███     ███    ███ ███    ███   ███    ███ \n", #1
    "      ███    ███     ███    ███ ███    ███   ███    █▀  \n", #2
    "     ▄███▄▄▄▄███▄▄   ███    ███ ███    ███  ▄███▄▄▄     \n", #3
    "    ▀▀███▀▀▀▀███▀  ▀███████████ ███    ███ ▀▀███▀▀▀     \n", #4
    "      ███    ███     ███    ███ ███    ███   ███    █▄  \n", #5
    "      ███    ███     ███    ███ ███    ███   ███    ███ \n", #6
    "      ███    █▀      ███    █▀   ▀██████▀    ██████████ \n", #7
]
A_DeltaCorpsPriest1 = [
    "       ▄████████ \n", #0
    "      ███    ███ \n", #1
    "      ███    ███ \n", #2
    "      ███    ███ \n", #3
    "    ▀███████████ \n", #4
    "      ███    ███ \n", #5
    "      ███    ███ \n", #6
    "      ███    █▀  \n", #7
]





I_BlurVisionASCII = [
    "    ░▒▓█▓▒░ \n", #0
    "    ░▒▓█▓▒░ \n", #1
    "    ░▒▓█▓▒░ \n", #2
    "    ░▒▓█▓▒░ \n", #3
    "    ░▒▓█▓▒░ \n", #4
    "    ░▒▓█▓▒░ \n", #5
    "    ░▒▓█▓▒░ \n", #6
]
DONT_BlurVisionASCII = [
    "    ░▒▓███████▓▒░ ░▒▓██████▓▒░░▒▓███████▓▒░▒▓████████▓▒░ \n", #0
    "    ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░ ░▒▓█▓▒░     \n", #1
    "    ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░ ░▒▓█▓▒░     \n", #2
    "    ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░ ░▒▓█▓▒░     \n", #3
    "    ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░ ░▒▓█▓▒░     \n", #4
    "    ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░ ░▒▓█▓▒░     \n", #5
    "    ░▒▓███████▓▒░ ░▒▓██████▓▒░░▒▓█▓▒░░▒▓█▓▒░ ░▒▓█▓▒░     \n", #6
]
HAVE_BlurVisionASCII = [
    "    ░▒▓█▓▒░░▒▓█▓▒░░▒▓██████▓▒░░▒▓█▓▒░░▒▓█▓▒░▒▓████████▓▒░ \n", #0
    "    ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░        \n", #1
    "    ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒▒▓█▓▒░░▒▓█▓▒░        \n", #2
    "    ░▒▓████████▓▒░▒▓████████▓▒░░▒▓█▓▒▒▓█▓▒░░▒▓██████▓▒░   \n", #3
    "    ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░ ░▒▓█▓▓█▓▒░ ░▒▓█▓▒░        \n", #4
    "    ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░ ░▒▓█▓▓█▓▒░ ░▒▓█▓▒░        \n", #5
    "    ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░  ░▒▓██▓▒░  ░▒▓████████▓▒░ \n", #6
]
A_BlurVisionASCII = [
    "     ░▒▓██████▓▒░  \n", #0
    "    ░▒▓█▓▒░░▒▓█▓▒░ \n", #1
    "    ░▒▓█▓▒░░▒▓█▓▒░ \n", #2
    "    ░▒▓████████▓▒░ \n", #3
    "    ░▒▓█▓▒░░▒▓█▓▒░ \n", #4
    "    ░▒▓█▓▒░░▒▓█▓▒░ \n", #5
    "    ░▒▓█▓▒░░▒▓█▓▒░ \n", #6
]





I_THIS = [
    "     ▄▀▀█▀▄   \n", #0
    "    █   █  █  \n", #1
    "    ▐   █  ▐  \n", #2
    "        █     \n", #3
    "     ▄▀▀▀▀▀▄  \n", #4
    "    █       █ \n", #5
    "    ▐       ▐ \n", #6
]
DONT_THIS = [
    "     ▄▀▀█▄▄   ▄▀▀▀▀▄   ▄▀▀▄ ▀▄  ▄▀▀▀█▀▀▄ \n", #0
    "    █ ▄▀   █ █      █ █  █ █ █ █    █  ▐ \n", #1
    "    ▐ █    █ █      █ ▐  █  ▀█ ▐   █     \n", #2
    "      █    █ ▀▄    ▄▀   █   █     █      \n", #3
    "     ▄▀▄▄▄▄▀   ▀▀▀▀   ▄▀   █    ▄▀       \n", #4
    "    █     ▐           █    ▐   █         \n", #5
    "    ▐                 ▐        ▐         \n", #6
]
HAVE_THIS = [
    "     ▄▀▀▄ ▄▄   ▄▀▀█▄   ▄▀▀▄ ▄▀▀▄  ▄▀▀█▄▄▄▄ \n", #0
    "    █  █   ▄▀ ▐ ▄▀ ▀▄ █   █    █ ▐  ▄▀   ▐ \n", #1
    "    ▐  █▄▄▄█    █▄▄▄█ ▐  █    █    █▄▄▄▄▄  \n", #2
    "       █   █   ▄▀   █    █   ▄▀    █    ▌  \n", #3
    "      ▄▀  ▄▀  █   ▄▀      ▀▄▀     ▄▀▄▄▄▄   \n", #4
    "     █   █    ▐   ▐               █    ▐   \n", #5
    "     ▐   ▐                        ▐        \n", #6
]
A_THIS = [
    "     ▄▀▀█▄  \n", #0
    "    ▐ ▄▀ ▀▄ \n", #1
    "      █▄▄▄█ \n", #2
    "     ▄▀   █ \n", #3
    "    █   ▄▀  \n", #4
    "    ▐   ▐   \n", #5
    "            \n", #6
]

        















































dogmaticalyric_nums = {
    0: ' ',
    1: 'FINAL.\n',
    2: 'FINAL.\nFINAL.',
    3: 'WE HAVE,\n',
    4: 'WE HAVE, 12 HOURS LEFT.\n',
    5: 'WE HAVE, 12 HOURS LEFT.\nWE HAVE,',
    6: 'WE HAVE, 12 HOURS LEFT.\nWE HAVE, 12 HOURS LEFT.',

    7: 'HEY!\n',
    8: 'HEY!\nHEY!',
    9: 'HE-\n',
    10: 'HE-HE-\n',
    11: 'HE-HE-EY!\n',
    12: 'HE-HE-EY!\nHE-',
    13: 'HE-HE-EY!\nHE-HE',
    14: 'HE-HE-EY!\nHE-HE-EY!',

    15: "CORPSE\n",
    16: "CORPSE LOCKED\n",
    17: "CORPSE LOCKED IN\n",
    18: "CORPSE LOCKED IN MY\n",
    19: "CORPSE LOCKED IN MY BATH-\n",
    20: "CORPSE LOCKED IN MY BATHROOM",
    21: "CORPSE LOCKED IN MY BATHROOM\nBLOOD",
    22: "CORPSE LOCKED IN MY BATHROOM\nBLOOD IS",
    23: "CORPSE LOCKED IN MY BATHROOM\nBLOOD IS IN-",
    24: "CORPSE LOCKED IN MY BATHROOM\nBLOOD IS INSIDE",
    25: "CORPSE LOCKED IN MY BATHROOM\nBLOOD IS INSIDE MY",
    26: "CORPSE LOCKED IN MY BATHROOM\nBLOOD IS INSIDE MY SINK",

    27: "I\n",
    28: "I WAN-\n",
    29: "I WANNA\n",
    30: BE_AMCSLASH[0]+BE_AMCSLASH[1]+BE_AMCSLASH[2]+BE_AMCSLASH[3]+BE_AMCSLASH[4]+BE_AMCSLASH[5]+BE_AMCSLASH[6]+BE_AMCSLASH[7]+BE_AMCSLASH[8]+BE_AMCSLASH[9]+BE_AMCSLASH[10]+BE_AMCSLASH[11]+BE_AMCSLASH[12]+BE_AMCSLASH[13]+BE_AMCSLASH[14],
    31: BE_AMCAAA01[0]+BE_AMCAAA01[1]+BE_AMCAAA01[2]+BE_AMCAAA01[3]+BE_AMCAAA01[4]+BE_AMCAAA01[5]+BE_AMCAAA01[6]+BE_AMCAAA01[7]+BE_AMCAAA01[8]+BE_AMCAAA01[9]+BE_AMCAAA01[10]+BE_AMCAAA01[11]+BE_AMCAAA01[12]+BE_AMCAAA01[13]+BE_AMCAAA01[14],
    32: "I WANNA B̴̲̗̫̱͆Ė̵̩̳̹͘͜͠ CA-\n",
    33: "I WANNA B̴̲̗̫̱͆Ė̵̩̳̹͘͜͠ CATA-\n",
    34: "I WANNA B̴̲̗̫̱͆Ė̵̩̳̹͘͜͠ CATATO-\n",
    35: "I WANNA B̴̲̗̫̱͆Ė̵̩̳̹͘͜͠ CATATONIC\n",
    36: "I WANNA B̴̲̗̫̱͆Ė̵̩̳̹͘͜͠ CATATONIC\nWHERE",
    37: "I WANNA B̴̲̗̫̱͆Ė̵̩̳̹͘͜͠ CATATONIC\nWHERE I-",
    38: "I WANNA B̴̲̗̫̱͆Ė̵̩̳̹͘͜͠ CATATONIC\nWHERE I-I",
    39: "I WANNA B̴̲̗̫̱͆Ė̵̩̳̹͘͜͠ CATATONIC\nWHERE I-I CANT",
    40: "I WANNA B̴̲̗̫̱͆Ė̵̩̳̹͘͜͠ CATATONIC\nWHERE I-I CANT E-",
    41: "I WANNA B̴̲̗̫̱͆Ė̵̩̳̹͘͜͠ CATATONIC\nWHERE I-I CANT EVEN",
    42: "I WANNA B̴̲̗̫̱͆Ė̵̩̳̹͘͜͠ CATATONIC\nWHERE I-I CANT EVEN THINK",

    43: "BLEE-\n",
    44: "BLEE-BLEED-\n",
    45: "BLEE-BLEEDING\n",
    46: "BLEE-BLEEDING OUT\n",
    47: "BLEE-BLEEDING OUT IN-\n",
    48: "BLEE-BLEEDING OUT INSIDE\n",
    49: "BLEE-BLEEDING OUT INSIDE MY\n",
    50: "BLEE-BLEEDING OUT INSIDE MY CLO-\n",
    51: "BLEE-BLEEDING OUT INSIDE MY CLOSET\n",
    52: "BLEE-BLEEDING OUT INSIDE MY CLOSET\nTHE",
    53: "BLEE-BLEEDING OUT INSIDE MY CLOSET\nTHE SECRETS,",
    54: "BLEE-BLEEDING OUT INSIDE MY CLOSET\nTHE SECRETS, THAT",
    55: "BLEE-BLEEDING OUT INSIDE MY CLOSET\nTHE SECRETS, THAT I",
    56: "BLEE-BLEEDING OUT INSIDE MY CLOSET\nTHE SECRETS, THAT I WILL",
    57: KEEP_AMCAAA01[0]+KEEP_AMCAAA01[1]+KEEP_AMCAAA01[2]+KEEP_AMCAAA01[3]+KEEP_AMCAAA01[4]+KEEP_AMCAAA01[5]+KEEP_AMCAAA01[6]+KEEP_AMCAAA01[7]+KEEP_AMCAAA01[8]+KEEP_AMCAAA01[9]+KEEP_AMCAAA01[10]+KEEP_AMCAAA01[11]+KEEP_AMCAAA01[12]+KEEP_AMCAAA01[13],
    58: KEEP_AMCAAA01[0]+KEEP_AMCAAA01[1]+KEEP_AMCAAA01[2]+KEEP_AMCAAA01[3]+KEEP_AMCAAA01[4]+KEEP_AMCAAA01[5]+KEEP_AMCAAA01[6]+KEEP_AMCAAA01[7]+KEEP_AMCAAA01[8]+KEEP_AMCAAA01[9]+KEEP_AMCAAA01[10]+KEEP_AMCAAA01[11]+KEEP_AMCAAA01[12]+KEEP_AMCAAA01[13],
    
    59: " WORTH-\n",
    60: "  WORTHLESS\n",
    61: "   WORTHLESS FUCK-\n",
    62: "    WORTHLESS FUCKING\n",
    63: "     WORTHLESS FUCKING CUM\n",
    64: "      WORTHLESS FUCKING CUM DE-\n",
    65: "       WORTHLESS FUCKING CUM DEPO-\n",
    66: "        WORTHLESS FUCKING CUM DEPOSIT\n",
    67: "         WORTHLESS FUCKING CUM DEPOSIT\n         I-",
    68: "          WORTHLESS FUCKING CUM DEPOSIT\n          I-I",
    69: "           WORTHLESS FUCKING CUM DEPOSIT\n           I-I DON'T",
    70: "            WORTHLESS FUCKING CUM DEPOSIT\n            I-I DON'T E-",
    71: "             WORTHLESS FUCKING CUM DEPOSIT\n             I-I DON'T EVER",
    72: "             WORTHLESS FUCKING CUM DEPOSIT\n             I-I DON'T EVER SLEEP",
    73: "ME-          WORTHLESS FUCKING CUM DEPOSIT\n             I-I DON'T EVER SLEEP",
    74: "ME-ME-       WORTHLESS FUCKING CUM DEPOSIT\n             I-I DON'T EVER SLEEP",
    75: "ME-ME-ME-    WORTHLESS FUCKING CUM DEPOSIT\n             I-I DON'T EVER SLEEP",

    76: "ME-ME-ME-   MEN-\n",
    77: "ME-ME-ME-  MENTAL\n",
    78: "ME-ME-ME  MENTAL SHARDS\n",
    79: "ME-ME-M  MENTAL SHARDS IN-\n",
    80: "ME-ME-  MENTAL SHARDS INSIDE\n",
    81: "ME-ME  MENTAL SHARDS INSIDE MY\n",
    79: "ME-M  MENTAL SHARDS INSIDE MY VO-\n",
    82: "ME-  MENTAL SHARDS INSIDE MY VOMIT\n",
    83: "ME  MENTAL SHARDS INSIDE MY VOMIT\n    GUN",
    84: "M  MENTAL SHARDS INSIDE MY VOMIT\n   GUN SHOTS",
    85: "  MENTAL SHARDS INSIDE MY VOMIT\n  GUN SHOTS THROUGH",
    86: " MENTAL SHARDS INSIDE MY VOMIT\n GUN SHOTS THROUGH THE",
    87: "MENTAL SHARDS INSIDE MY VOMIT\nGUN SHOTS THROUGH THE DOOR",

    88: "I",
    89: "I CAN",
    90: "I CAN TAKE",
    91: "I CAN TAKE JUST",
    92: "I CAN TAKE JUST WHAT",
    93: "I CAN TAKE JUST WHAT I",
    94: "I CAN TAKE JUST WHAT I WAN-",
    95: "I CAN TAKE JUST WHAT I WANTED",

    96: "WHEN",
    97: "WHEN I-",
    98: "WHEN I-I",
    99: "WHEN I-I SET-",
    100: "WHEN I-I SETTLE",
    101: "WHEN I-I SETTLE THE",
    102: "WHEN I-I SETTLE THE SCORE",

    103: "CU-\n",
    104: "CU-CUT\n",
    105: "CU-CUT MY-\n",
    106: "CU-CUT MYSELF\n",
    107: "CU-CUT MYSELF UP\n",
    108: "CU-CUT MYSELF UP IN\n", 
    109: "CU-CUT MYSELF UP IN A\n",
    110: "CU-CUT MYSELF UP IN A RIB-\n",
    111: "CU-CUT MYSELF UP IN A RIBBONS\n",
    112: "CU-CUT MYSELF UP IN A RIBBONS\nALL-",
    113: "CU-CUT MYSELF UP IN A RIBBONS\nALL-ALL",
    114: "CU-CUT MYSELF UP IN A RIBBONS\nALL-ALL O-",
    115: "CU-CUT MYSELF UP IN A RIBBONS\nALL-ALL OVER",
    116: "CU-CUT MYSELF UP IN A RIBBONS\nALL-ALL OVER THE",
    117: "CU-CUT MYSELF UP IN A RIBBONS\nALL-ALL OVER THE FLOOR",

    118: "I\n",
    119: "I GOT\n",
    120: "I GOT BITE\n",
    121: "I GOT BITE MARKS\n",
    122: "I GOT BITE MARKS ON\n",
    123: "I GOT BITE MARKS ON MY\n",
    124: "I GOT BITE MARKS ON MY STO-\n",
    125: "I GOT BITE MARKS ON MY STOMACH\n",
    126: "I GOT BITE MARKS ON MY STOMACH\nTHAT",
    127: "I GOT BITE MARKS ON MY STOMACH\nTHAT WERE-",
    128: "I GOT BITE MARKS ON MY STOMACH\nTHAT WEREN'T",
    129: "I GOT BITE MARKS ON MY STOMACH\nTHAT WEREN'T HERE",
    130: "I GOT BITE MARKS ON MY STOMACH\nTHAT WEREN'T HERE BE-",
    131: "I GOT BITE MARKS ON MY STOMACH\nTHAT WEREN'T HERE BEFORE\n"+BEFORE_BLURVISIONASCII[0]+BEFORE_BLURVISIONASCII[1]+BEFORE_BLURVISIONASCII[2]+BEFORE_BLURVISIONASCII[3]+BEFORE_BLURVISIONASCII[4]+BEFORE_BLURVISIONASCII[5]+BEFORE_BLURVISIONASCII[6],
    132: "I GOT BITE MARKS ON MY STOMACH\nTHAT WEREN'T HERE BEFORE\n"+BEFORE_BLURVISIONASCII[0]+BEFORE_BLURVISIONASCII[1]+BEFORE_BLURVISIONASCII[2]+BEFORE_BLURVISIONASCII[3]+BEFORE_BLURVISIONASCII[4]+BEFORE_BLURVISIONASCII[5]+BEFORE_BLURVISIONASCII[6]+BEFORE_BLURVISIONASCII[0]+BEFORE_BLURVISIONASCII[1]+BEFORE_BLURVISIONASCII[2]+BEFORE_BLURVISIONASCII[3]+BEFORE_BLURVISIONASCII[4]+BEFORE_BLURVISIONASCII[5]+BEFORE_BLURVISIONASCII[6],
    133: "I GOT BITE MARKS ON MY STOMACH\nTHAT WEREN'T HERE BEFORE\n"+BEFORE_BLURVISIONASCII[0]+BEFORE_BLURVISIONASCII[1]+BEFORE_BLURVISIONASCII[2]+BEFORE_BLURVISIONASCII[3]+BEFORE_BLURVISIONASCII[4]+BEFORE_BLURVISIONASCII[5]+BEFORE_BLURVISIONASCII[6]+BEFORE_BLURVISIONASCII[0]+BEFORE_BLURVISIONASCII[1]+BEFORE_BLURVISIONASCII[2]+BEFORE_BLURVISIONASCII[3]+BEFORE_BLURVISIONASCII[4]+BEFORE_BLURVISIONASCII[5]+BEFORE_BLURVISIONASCII[6]+BEFORE_BLURVISIONASCII[0]+BEFORE_BLURVISIONASCII[1]+BEFORE_BLURVISIONASCII[2]+BEFORE_BLURVISIONASCII[3]+BEFORE_BLURVISIONASCII[4]+BEFORE_BLURVISIONASCII[5]+BEFORE_BLURVISIONASCII[6],
    134: "I GOT BITE MARKS ON MY STOMACH\nTHAT WEREN'T HERE BEFORE\n"+BEFORE_BLURVISIONASCII[0]+BEFORE_BLURVISIONASCII[1]+BEFORE_BLURVISIONASCII[2]+BEFORE_BLURVISIONASCII[3]+BEFORE_BLURVISIONASCII[4]+BEFORE_BLURVISIONASCII[5]+BEFORE_BLURVISIONASCII[6]+BEFORE_BLURVISIONASCII[0]+BEFORE_BLURVISIONASCII[1]+BEFORE_BLURVISIONASCII[2]+BEFORE_BLURVISIONASCII[3]+BEFORE_BLURVISIONASCII[4]+BEFORE_BLURVISIONASCII[5]+BEFORE_BLURVISIONASCII[6]+BEFORE_BLURVISIONASCII[0]+BEFORE_BLURVISIONASCII[1]+BEFORE_BLURVISIONASCII[2]+BEFORE_BLURVISIONASCII[3]+BEFORE_BLURVISIONASCII[4]+BEFORE_BLURVISIONASCII[5]+BEFORE_BLURVISIONASCII[6]+BEFORE_BLURVISIONASCII[0]+BEFORE_BLURVISIONASCII[1]+BEFORE_BLURVISIONASCII[2]+BEFORE_BLURVISIONASCII[3]+BEFORE_BLURVISIONASCII[4]+BEFORE_BLURVISIONASCII[5]+BEFORE_BLURVISIONASCII[6],

    135: "BLOOD\n",
    136: "BLOOD BE-\n",
    137: "BLOOD BEHIND\n", 
    138: "BLOOD BEHIND MY\n",
    139: "BLOOD BEHIND MY EYES\n",
    140: "BLOOD BEHIND MY EYES WHEN\n",
    141: "BLOOD BEHIND MY EYES WHEN\nI",
    142: "BLOOD BEHIND MY EYES WHEN\nI TRY",
    143: "BLOOD BEHIND MY EYES WHEN\nI TRY TO", 
    144: "BLOOD BEHIND MY EYES WHEN\nI TRY TO SLEEP",
    145: "BLOOD BEHIND MY EYES WHEN\nI TRY TO SLEEP AT",
    146: "BLOOD BEHIND MY EYES WHEN\nI TRY TO SLEEP AT NIGHT",

    147: "GO-\n",
    148: "GOING\n",
    149: "GOING MISS-\n",
    150: "GOING MISSING\n", 
    151: "GOING MISSING WHEN\n",
    152: "GOING MISSING WHEN\nMY",
    153: "GOING MISSING WHEN\nMY MIND",
    154: "GOING MISSING WHEN\nMY MIND TURNS", 
    155: "GOING MISSING WHEN\nMY MIND TURNS OUT",
    156: "GOING MISSING WHEN\nMY MIND TURNS OUT THE",
    157: "GOING MISSING WHEN\nMY MIND TURNS OUT THE LIGHTS",

    158: I_BIG[0]+I_BIG[1]+I_BIG[2]+I_BIG[3]+I_BIG[4]+I_BIG[5], 
    159: DONT_BIG[0]+DONT_BIG[1]+DONT_BIG[2]+DONT_BIG[3]+DONT_BIG[4]+DONT_BIG[5],
    160: HAVE_BIG[0]+HAVE_BIG[1]+HAVE_BIG[2]+HAVE_BIG[3]+HAVE_BIG[4]+HAVE_BIG[5],
    161: A_BIG[0]+A_BIG[1]+A_BIG[2]+A_BIG[3]+A_BIG[4]+A_BIG[5],

    162: I_SBLOOD[0]+I_SBLOOD[1]+I_SBLOOD[2]+I_SBLOOD[3]+I_SBLOOD[4], 
    163: DONT_SBLOOD[0]+DONT_SBLOOD[1]+DONT_SBLOOD[2]+DONT_SBLOOD[3]+DONT_SBLOOD[4], 
    164: HAVE_SBLOOD[0]+HAVE_SBLOOD[1]+HAVE_SBLOOD[2]+HAVE_SBLOOD[3]+HAVE_SBLOOD[4],
    165: A_SBLOOD[0]+A_SBLOOD[1]+A_SBLOOD[2]+A_SBLOOD[3]+A_SBLOOD[4],

    166: I_ANSIREGULAR[0]+I_ANSIREGULAR[1]+I_ANSIREGULAR[2]+I_ANSIREGULAR[3]+I_ANSIREGULAR[4],
    167: DONT_ANSIREGULAR[0]+DONT_ANSIREGULAR[1]+DONT_ANSIREGULAR[2]+DONT_ANSIREGULAR[3]+DONT_ANSIREGULAR[4],
    168: HAVE_ANSIREGULAR[0]+HAVE_ANSIREGULAR[1]+HAVE_ANSIREGULAR[2]+HAVE_ANSIREGULAR[3]+HAVE_ANSIREGULAR[4],
    169: A_ANSIREGULAR[0]+A_ANSIREGULAR[1]+A_ANSIREGULAR[2]+A_ANSIREGULAR[3]+A_ANSIREGULAR[4],

    170: I_THEEDGE[0]+I_THEEDGE[1]+I_THEEDGE[2]+I_THEEDGE[3]+I_THEEDGE[4]+I_THEEDGE[5]+I_THEEDGE[6],  
    171: DONT_THEEDGE[0]+DONT_THEEDGE[1]+DONT_THEEDGE[2]+DONT_THEEDGE[3]+DONT_THEEDGE[4]+DONT_THEEDGE[5]+DONT_THEEDGE[6],
    172: HAVE_THEEDGE[0]+HAVE_THEEDGE[1]+HAVE_THEEDGE[2]+HAVE_THEEDGE[3]+HAVE_THEEDGE[4]+HAVE_THEEDGE[5]+HAVE_THEEDGE[6],
    173: A_THEEDGE[0]+A_THEEDGE[1]+A_THEEDGE[2]+A_THEEDGE[3]+A_THEEDGE[4]+A_THEEDGE[5]+A_THEEDGE[6],

    174: I_AMCSlash[0]+I_AMCSlash[1]+I_AMCSlash[2]+I_AMCSlash[3]+I_AMCSlash[4]+I_AMCSlash[5]+I_AMCSlash[6]+I_AMCSlash[7]+I_AMCSlash[8],
    175: DONT_AMCSlash[0]+DONT_AMCSlash[1]+DONT_AMCSlash[2]+DONT_AMCSlash[3]+DONT_AMCSlash[4]+DONT_AMCSlash[5]+DONT_AMCSlash[6]+DONT_AMCSlash[7]+DONT_AMCSlash[8], 
    176: HAVE_AMCSlash[0]+HAVE_AMCSlash[1]+HAVE_AMCSlash[2]+HAVE_AMCSlash[3]+HAVE_AMCSlash[4]+HAVE_AMCSlash[5]+HAVE_AMCSlash[6]+HAVE_AMCSlash[7]+HAVE_AMCSlash[8], 
    177: A_AMCSlash[0]+A_AMCSlash[1]+A_AMCSlash[2]+A_AMCSlash[3]+A_AMCSlash[4]+A_AMCSlash[5]+A_AMCSlash[6]+A_AMCSlash[7]+A_AMCSlash[8], 

    178: I_DeltaCorpsPriest1[0]+I_DeltaCorpsPriest1[1]+I_DeltaCorpsPriest1[2]+I_DeltaCorpsPriest1[3]+I_DeltaCorpsPriest1[4]+I_DeltaCorpsPriest1[5]+I_DeltaCorpsPriest1[6]+I_DeltaCorpsPriest1[7], 
    179: DONT_DeltaCorpsPriest1[0]+DONT_DeltaCorpsPriest1[1]+DONT_DeltaCorpsPriest1[2]+DONT_DeltaCorpsPriest1[3]+DONT_DeltaCorpsPriest1[4]+DONT_DeltaCorpsPriest1[5]+DONT_DeltaCorpsPriest1[6]+DONT_DeltaCorpsPriest1[7], 
    180: HAVE_DeltaCorpsPriest1[0]+HAVE_DeltaCorpsPriest1[1]+HAVE_DeltaCorpsPriest1[2]+HAVE_DeltaCorpsPriest1[3]+HAVE_DeltaCorpsPriest1[4]+HAVE_DeltaCorpsPriest1[5]+HAVE_DeltaCorpsPriest1[6]+HAVE_DeltaCorpsPriest1[7],
    181: A_DeltaCorpsPriest1[0]+A_DeltaCorpsPriest1[1]+A_DeltaCorpsPriest1[2]+A_DeltaCorpsPriest1[3]+A_DeltaCorpsPriest1[4]+A_DeltaCorpsPriest1[5]+A_DeltaCorpsPriest1[6]+A_DeltaCorpsPriest1[7], 

    182: I_BlurVisionASCII[0]+I_BlurVisionASCII[1]+I_BlurVisionASCII[2]+I_BlurVisionASCII[3]+I_BlurVisionASCII[4]+I_BlurVisionASCII[5]+I_BlurVisionASCII[6], 
    183: DONT_BlurVisionASCII[0]+DONT_BlurVisionASCII[1]+DONT_BlurVisionASCII[2]+DONT_BlurVisionASCII[3]+DONT_BlurVisionASCII[4]+DONT_BlurVisionASCII[5]+DONT_BlurVisionASCII[6], 
    184: HAVE_BlurVisionASCII[0]+HAVE_BlurVisionASCII[1]+HAVE_BlurVisionASCII[2]+HAVE_BlurVisionASCII[3]+HAVE_BlurVisionASCII[4]+HAVE_BlurVisionASCII[5]+HAVE_BlurVisionASCII[6], 
    185: A_BlurVisionASCII[0]+A_BlurVisionASCII[1]+A_BlurVisionASCII[2]+A_BlurVisionASCII[3]+A_BlurVisionASCII[4]+A_BlurVisionASCII[5]+A_BlurVisionASCII[6], 

    186: I_THIS[0]+I_THIS[1]+I_THIS[2]+I_THIS[3]+I_THIS[4]+I_THIS[5]+I_THIS[6], 
    187: DONT_THIS[0]+DONT_THIS[1]+DONT_THIS[2]+DONT_THIS[3]+DONT_THIS[4]+DONT_THIS[5]+DONT_THIS[6], 
    188: HAVE_THIS[0]+HAVE_THIS[1]+HAVE_THIS[2]+HAVE_THIS[3]+HAVE_THIS[4]+HAVE_THIS[5]+HAVE_THIS[6], 
    189: A_THIS[0]+A_THIS[1]+A_THIS[2]+A_THIS[3]+A_THIS[4]+A_THIS[5]+A_THIS[6], 

    190: "THINK\n", 
    191: "THINK TWICE\n", 
    192: "THINK TWICE\nTHINK\n", 
    193: "THINK TWICE\nTHINK TWICE\n",
    194: "THINK TWICE\nTHINK TWICE\nTHINK\n",
    195: "THINK TWICE\nTHINK TWICE\nTHINK TWICE\n",
    196: "THINK TWICE\nTHINK TWICE\nTHINK TWICE\nTHINK-",

    197: "I-\n",
    198: "I-I\n",
    199: "I-I WILL\n",
    200: "I-I WILL BE\n",
    201: "I-I WILL BE IN\n",
    202: "I-I WILL BE IN LOVE",
    203: "I-I WILL BE IN LOVE FOR-\n",
    204: "I-I WILL BE IN LOVE FORE-\n",
    205: "I-I WILL BE IN LOVE FOREVER\n",
    206: "I-I WILL BE IN LOVE FOREVER\nCAUSE",
    207: "I-I WILL BE IN LOVE FOREVER\nCAUSE I'M",
    208: "I-I WILL BE IN LOVE FOREVER\nCAUSE I'M GON-",
    209: "I-I WILL BE IN LOVE FOREVER\nCAUSE I'M GONNA",
    210: "I-I WILL BE IN LOVE FOREVER\nCAUSE I'M GONNA DIE",
    211: "I-I WILL BE IN LOVE FOREVER\nCAUSE I'M GONNA DIE TO-",
    212: "I-I WILL BE IN LOVE FOREVER\nCAUSE I'M GONNA DIE TONIGHT\n",

    213: "BE-\n",
    214: "BEFORE\n",
    215: "BEFORE I\n",
    216: "BEFORE I BLOOM\n",
    217: "BEFORE I BLOOM IN-\n",
    218: "BEFORE I BLOOM INTO\n",
    219: "BEFORE I BLOOM INTO A\n",
    220: "BEFORE I BLOOM INTO A FLO-\n",
    221: "BEFORE I BLOOM INTO A FLOWER\n",
    222: "BEFORE I BLOOM INTO A FLOWER\nFIRST",
    223: "BEFORE I BLOOM INTO A FLOWER\nFIRST I",
    224: "BEFORE I BLOOM INTO A FLOWER\nFIRST I WAN-",
    225: "BEFORE I BLOOM INTO A FLOWER\nFIRST I WANNA",
    226: "BEFORE I BLOOM INTO A FLOWER\nFIRST I WANNA SAY",
    227: "BEFORE I BLOOM INTO A FLOWER\nFIRST I WANNA SAY GOOD-",
    228: GOODBYE_BLOODY[0]+GOODBYE_BLOODY[1]+GOODBYE_BLOODY[2]+GOODBYE_BLOODY[3]+GOODBYE_BLOODY[4]+GOODBYE_BLOODY[5]+GOODBYE_BLOODY[6]+GOODBYE_BLOODY[7]+GOODBYE_BLOODY[8]+GOODBYE_BLOODY[9],

    229: "",
    230: "",







   

    #BEFORE I BLOOM INTO A FLOWER\nFIRST I WANNA SAY GOODBYE

    #Transformation complete You are now, as you once were. Beautiful You are Dogmatica
    
#   _____ _    _ _    _ _______ 
#  / ____| |  | | |  | |__   __|
# | (___ | |__| | |  | |  | |   
#  \___ \|  __  | |  | |  | |      Font Name: Big
#  ____) | |  | | |__| |  | |   
# |_____/|_|  |_|\____/   |_|   

# ░▒▓███████▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓████████▓▒░ 
#░▒▓█▓▒░      ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░  ░▒▓█▓▒░     
#░▒▓█▓▒░      ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░  ░▒▓█▓▒░     
# ░▒▓██████▓▒░░▒▓████████▓▒░▒▓█▓▒░░▒▓█▓▒░  ░▒▓█▓▒░       Font Name: BlurVision ASCII
#       ░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░  ░▒▓█▓▒░     
#       ░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░  ░▒▓█▓▒░     
#░▒▓███████▓▒░░▒▓█▓▒░░▒▓█▓▒░░▒▓██████▓▒░   ░▒▓█▓▒░     

#   SSSSSSSSSSSSSSS HHHHHHHHH     HHHHHHHHHUUUUUUUU     UUUUUUUUTTTTTTTTTTTTTTTTTTTTTTT
# SS:::::::::::::::SH:::::::H     H:::::::HU::::::U     U::::::UT:::::::::::::::::::::T
#S:::::SSSSSS::::::SH:::::::H     H:::::::HU::::::U     U::::::UT:::::::::::::::::::::T
#S:::::S     SSSSSSSHH::::::H     H::::::HHUU:::::U     U:::::UUT:::::TT:::::::TT:::::T
#S:::::S              H:::::H     H:::::H   U:::::U     U:::::U TTTTTT  T:::::T  TTTTTT
#S:::::S              H:::::H     H:::::H   U:::::D     D:::::U         T:::::T        
# S::::SSSS           H::::::HHHHH::::::H   U:::::D     D:::::U         T:::::T        
#  SS::::::SSSSS      H:::::::::::::::::H   U:::::D     D:::::U         T:::::T            Font Name: Doh
#    SSS::::::::SS    H:::::::::::::::::H   U:::::D     D:::::U         T:::::T        
#       SSSSSS::::S   H::::::HHHHH::::::H   U:::::D     D:::::U         T:::::T        
#            S:::::S  H:::::H     H:::::H   U:::::D     D:::::U         T:::::T        
#            S:::::S  H:::::H     H:::::H   U::::::U   U::::::U         T:::::T        
#SSSSSSS     S:::::SHH::::::H     H::::::HH U:::::::UUU:::::::U       TT:::::::TT      
#S::::::SSSSSS:::::SH:::::::H     H:::::::H  UU:::::::::::::UU        T:::::::::T      
#S:::::::::::::::SS H:::::::H     H:::::::H    UU:::::::::UU          T:::::::::T      
# SSSSSSSSSSSSSSS   HHHHHHHHH     HHHHHHHHH      UUUUUUUUU            TTTTTTTTTTT      

#███████ ██   ██ ██    ██ ████████ 
#██      ██   ██ ██    ██    ██    
#███████ ███████ ██    ██    ██      Font Name: ANSI Regular
#     ██ ██   ██ ██    ██    ██    
#███████ ██   ██  ██████     ██    





#  ██████  ██░ ██  █    ██ ▄▄▄█████▓
#▒██    ▒ ▓██░ ██▒ ██  ▓██▒▓  ██▒ ▓▒
#░ ▓██▄   ▒██▀▀██░▓██  ▒██░▒ ▓██░ ▒░   Font Name: Bloody
#  ▒   ██▒░▓█ ░██ ▓▓█  ░██░░ ▓██▓ ░ 
#▒██████▒▒░▓█▒░██▓▒▒█████▓   ▒██▒ ░ 
#▒ ▒▓▒ ▒ ░ ▒ ░░▒░▒░▒▓▒ ▒ ▒   ▒ ░░   
#░ ░▒  ░ ░ ▒ ░▒░ ░░░▒░ ░ ░     ░    
#░  ░  ░   ░  ░░ ░ ░░░ ░ ░   ░      
#      ░   ░  ░  ░   ░              
#                                   





#   ▄████████    ▄█    █▄    ███    █▄      ███     
#  ███    ███   ███    ███   ███    ███ ▀█████████▄ 
#  ███    █▀    ███    ███   ███    ███    ▀███▀▀██ 
#  ███         ▄███▄▄▄▄███▄▄ ███    ███     ███   ▀ 
#▀███████████ ▀▀███▀▀▀▀███▀  ███    ███     ███        Font Name: Delta Corps Priest 1
#         ███   ███    ███   ███    ███     ███     
#   ▄█    ███   ███    ███   ███    ███     ███     
# ▄████████▀    ███    █▀    ████████▀     ▄████▀   

# ▄▀▀▀▀▄  ▄▀▀▄ ▄▄   ▄▀▀▄ ▄▀▀▄  ▄▀▀▀█▀▀▄ 
#█ █   ▐ █  █   ▄▀ █   █    █ █    █  ▐ 
#   ▀▄   ▐  █▄▄▄█  ▐  █    █  ▐   █     
#▀▄   █     █   █    █    █      █          Font Name: THIS
# █▀▀▀     ▄▀  ▄▀     ▀▄▄▄▄▀   ▄▀       
# ▐       █   █               █         
#        ▐   ▐               ▐         

#   ▄▄▄▄▄    ▄  █   ▄     ▄▄▄▄▀ 
#  █     ▀▄ █   █    █ ▀▀▀ █    
#▄  ▀▀▀▀▄   ██▀▀█ █   █    █       Font Name: The Edge
# ▀▄▄▄▄▀    █   █ █   █   █     
#              █  █▄ ▄█  ▀      
#             ▀    ▀▀▀          

#  @@@@@@ @@@  @@@ @@@  @@@ @@@@@@@
# !@@     @@!  @@@ @@!  @@@   @@!  
#  !@@!!  @!@!@!@! @!@  !@!   @!!       Font Name: S Blood
#     !:! !!:  !!! !!:  !!!   !!:  
# ::.: :   :   : :  :.:: :     :   





#   sSSs   .S    S.    .S       S.   sdSS_SSSSSSbs  
#  d%%SP  .SS    SS.  .SS       SS.  YSSS~S%SSSSSP  
# d%S'    S%S    S%S  S%S       S%S       S%S       
# S%|     S%S    S%S  S%S       S%S       S%S       
# S&S     S%S SSSS%S  S&S       S&S       S&S       
# Y&Ss    S&S  SSS&S  S&S       S&S       S&S            Font Name: AMC AAA01
# `S&&S   S&S    S&S  S&S       S&S       S&S       
#   `S*S  S&S    S&S  S&S       S&S       S&S       
#    l*S  S*S    S*S  S*b       d*S       S*S       
#   .S*P  S*S    S*S  S*S.     .S*S       S*S       
# sSS*S   S*S    S*S   SSSbs_sdSSS        S*S       
# YSS'    SSS    S*S    YSSP~YSSY         S*S       
#                SP                       SP        
#                Y                        Y         

#.s5SSSs.  .s    s.  .s    s.  .s5SSSSs. 
#      SS.       SS.       SS.    SSS    
#sS    `:; sS    S%S sS    S%S    S%S    
#SS        SS    S%S SS    S%S    S%S    
#`:;;;;.   SSSs. S%S SS    S%S    S%S       Font Name: AMC Slash
#      ;;. SS    S%S SS    S%S    S%S    
#      `:; SS    `:; SS    `:;    `:;    
#.,;   ;,. SS    ;,. SS    ;,.    ;,.    
#`:;;;;;:' :;    ;:' `:;;;;;:'    ;:'    




  






















}
































Months_leapyear = {
    1: 31,
    2: 29,
    3: 31, 
    4: 30,
    5: 31,
    6: 30,
    7: 31,
    8: 31,
    9: 30,
    10: 31,
    11: 30,
    12: 31
} 
Months = {
    1: 31,
    2: 28,
    3: 31, 
    4: 30,
    5: 31,
    6: 30,
    7: 31,
    8: 31,
    9: 30,
    10: 31,
    11: 30,
    12: 31
} 

date1day = int(19)
date1month = int(10)
date1year = int(2024)
date1hour = int(10)
date1minute = int(59)
date1second = int(0)

if len(str(date1day)) == 1:
    str_date1day = str('0'+str(date1day))
else:
    str_date1day = str(str(date1day))
    
if len(str(date1month)) == 1:
    str_date1month = str('0'+str(date1month))
else:
    str_date1month = str(str(date1month))

if len(str(date1year)) == 3:
    str_date1year = str('0'+str(date1year))
if len(str(date1year)) == 2:
    str_date1year = str('00'+str(date1year))
if len(str(date1year)) == 1:
    str_date1year = str('000'+str(date1year))
else:
    str_date1year = str(str(date1year))

if len(str(date1hour)) == 1:
    str_date1hour = str('0'+str(date1hour))
else:
    str_date1hour = str(str(date1hour))

if len(str(date1minute)) == 1:
    str_date1minute = str('0'+str(date1minute))
else:
    str_date1minute = str(str(date1minute))

if len(str(date1second)) == 1:
    str_date1second = str('0'+str(date1second))
else:
    str_date1second = str(str(date1second))



date1datetime_print = str_date1day+'.'+str_date1month+'.'+str_date1year+' '+str_date1hour+':'+str_date1minute+':'+str_date1second

while True:
    
    os.system('cls||clear')
    
    dayNOW = int(time.strftime('%d'))
    monthNOW = int(time.strftime('%m'))
    yearNOW = int(time.strftime('%Y'))

    hourNOW = int(time.strftime('%H'))
    minuteNOW = int(time.strftime('%M'))
    secondNOW = int(time.strftime('%S'))

        
        
    
    str_dayNOW = str(time.strftime('%d'))
    str_monthNOW = str(time.strftime('%m'))
    str_yearNOW = str(time.strftime('%Y'))

    str_hourNOW = str(time.strftime('%H'))
    str_minuteNOW = str(time.strftime('%M'))
    str_secondNOW = str(time.strftime('%S'))

    datetimeNOW_print = str(str_dayNOW+'.'+str_monthNOW+'.'+str_yearNOW+' '+str_hourNOW+':'+str_minuteNOW+':'+str_secondNOW)

    years_leftto_date1 = date1year - yearNOW
    months_leftto_date1 = date1month - monthNOW
    days_leftto_date1 = date1day - dayNOW
                 
    hours_leftto_date1 = date1hour - hourNOW
    minutes_leftto_date1 = date1minute - minuteNOW
    seconds_leftto_date1 = date1second - secondNOW
    
    

    if hours_leftto_date1 < 0:
        hours_leftto_date1 = 24 + date1hour - hourNOW
        days_leftto_date1 -=1
    
    if minutes_leftto_date1 < 0:
        minutes_leftto_date1 = 60 + date1minute - minuteNOW 
        hours_leftto_date1 -= 1
    
    if seconds_leftto_date1 < 0:
        seconds_leftto_date1 = 60 + date1second - secondNOW
        minutes_leftto_date1-=1
    
    if minutes_leftto_date1 < 0:
        minutes_leftto_date1 = 59 + date1minute - minuteNOW 
        hours_leftto_date1 -= 1
    
    if days_leftto_date1 < 0:
        if yearNOW / 4:
            days_leftto_date1 = Months_leapyear[monthNOW] + date1day - dayNOW
            months_leftto_date1 -=1
            
        else:
            days_leftto_date1 = Months[monthNOW] + date1day - dayNOW
            months_leftto_date1 -=1
            
    

            
            
    
    
    
    
    
    
    if len(str(days_leftto_date1)) == 1:
        str_days_leftto_date1 = str('0'+str(days_leftto_date1))
    else:
        str_days_leftto_date1 = str(days_leftto_date1)
    
    if len(str(months_leftto_date1)) == 1:
        str_months_leftto_date1 = str('0'+str(months_leftto_date1))
    else:
        str_months_leftto_date1 = str(str(months_leftto_date1))

    if len(str(years_leftto_date1)) == 3:
        str_years_leftto_date1 = str('0'+str(years_leftto_date1))
    if len(str(years_leftto_date1)) == 2:
        str_years_leftto_date1 = str('00'+str(years_leftto_date1))
    if len(str(years_leftto_date1)) == 1:
        str_years_leftto_date1 = str('000'+str(years_leftto_date1))
    else:
        str_years_leftto_date1 = str(str(years_leftto_date1))
    


    if len(str(hours_leftto_date1)) == 1:
        str_hours_leftto_date1 = str('0'+str(hours_leftto_date1))
    else:
        str_hours_leftto_date1 = str(str(hours_leftto_date1))

    if len(str(minutes_leftto_date1)) == 1:
        str_minutes_leftto_date1 = str('0'+str(minutes_leftto_date1))
    else:
        str_minutes_leftto_date1 = str(str(minutes_leftto_date1))

    if len(str(seconds_leftto_date1)) == 1:
        str_seconds_leftto_date1 = str('0'+str(seconds_leftto_date1))
    else:
        str_seconds_leftto_date1 = str(str(seconds_leftto_date1))




    date_leftto_date1_print = str(str_days_leftto_date1 + '.'+str_months_leftto_date1+'.'+str_years_leftto_date1)

    time_leftto_date1_print = str(str_hours_leftto_date1+':'+str_minutes_leftto_date1+':'+str_seconds_leftto_date1)

    print('Date today:\n' + datetimeNOW_print+'\n')
    print('Counting from:\n'+date1datetime_print+'\n')
    print('Time left:\n'+date_leftto_date1_print+' '+time_leftto_date1_print)
    

    days_leftto_date1 = 0
    years_leftto_date1 = 0
    months_leftto_date1 = 0

    hours_leftto_date1 = 11
    minutes_leftto_date1 = 59
    #secret
    if days_leftto_date1 == 0 and years_leftto_date1 == 0 and months_leftto_date1 == 0 and hours_leftto_date1 == 11 and minutes_leftto_date1 < 60 and minutes_leftto_date1 > 0:
        
        #360 bpm (x2) = 0.16 sec
        #0.16 x 2 = 0.32
        #0.16 x 3 = 0.48
        #0.16 x 4 = 0.64
        #0.16 x 5 = 0.80
        #0.16 x 6 = 0.96
        #0.16 x 7 = 1.12
        #0.16 x 8 = 1.28
        #0.16 x 9 = 1.44
        #0.16 x 10 = 1.60
        #0.16 x 11 = 1.76
        #0.16 x 12 = 1.92


        
        dir_to_file_FOLDER = os.path.dirname(os.path.realpath(__file__))
        try:
            dogmatica = pyglet.media.load(dir_to_file_FOLDER+'\\DOGMATICA.mp3')
            dogmatica.play()

            
        except FileNotFoundError:
            youtube_link = YouTube('https://music.youtube.com/watch?v=uv8f3V-_rEk&list=OLAK5uy_lpQzqyS3ik4ixd20K6ic1uO0ckGd6_oNk')
            youtube_link.streams.get_by_itag(140).download(dir_to_file_FOLDER,'DOGMATICA.mp3') 

            dogmatica = pyglet.media.load(dir_to_file_FOLDER+'\\DOGMATICA.mp3')
            dogmatica.play()

        time.sleep(0.16)
        os.system('cls||clear')
        print('Time left:\n00.00.0000 12:00:00')
        print('\n')
        print('Final.')

        time.sleep(1.76)
        os.system('cls||clear')
        print('Time left:\n00.00.0000 12:00:00')
        print('\n')
        print('Final. Final.')

        time.sleep(1.76)
        os.system('cls||clear')
        print('Time left:\n00.00.0000 12:00:00')
        print('\n')
        print('We have,')

        time.sleep(0.96)
        os.system('cls||clear')
        print('Time left:\n00.00.0000 12:00:00')
        print('\n')
        print('We have, 12 hours left.')

        time.sleep(1.60)
        os.system('cls||clear')
        print('Time left:\n00.00.0000 12:00:00')
        print('\n')
        print('We have, 12 hours left.')
        print('We have,')

        time.sleep(0.96)
        os.system('cls||clear')
        print('Time left:\n00.00.0000 12:00:00')
        print('\n')
        print('We have, 12 hours left.')
        print('We have, 12 hours left.')
    


        time.sleep(2.24)
        os.system('cls||clear')
        print('Time left:\n00.00.0000 12:00:00')
        print('\n')
        print('Final.')

        time.sleep(1.76)
        os.system('cls||clear')
        print('Time left:\n00.00.0000 12:00:00')
        print('\n')
        print('Final. Final.')

        time.sleep(1.76)
        os.system('cls||clear')
        print('Time left:\n00.00.0000 12:00:00')
        print('\n')
        print('We have,')

        time.sleep(0.96)
        os.system('cls||clear')
        print('Time left:\n00.00.0000 12:00:00')
        print('\n')
        print('We have, 12 hours left.')

        time.sleep(1.60)
        os.system('cls||clear')
        print('Time left:\n00.00.0000 12:00:00')
        print('\n')
        print('We have, 12 hours left.')
        print('We have,')

        time.sleep(0.96)
        os.system('cls||clear')
        print('Time left:\n00.00.0000 12:00:00')
        print('\n')
        print('We have, 12 hours left.')
        print('We have, 12 hours left.')

        time.sleep(1.44)
        os.system('cls||clear')
        print('Time left:\n00.00.0000 12:00:00')
        print('\n')
        print('12...')

        time.sleep(0.32)
        os.system('cls||clear')
        print('Time left:\n00.00.0000 12:00:00')
        print('\n')
        print('Hey!')
        print('Hours...')
        
        time.sleep(0.40)
        os.system('cls||clear')
        print('Time left:\n00.00.0000 12:00:00')
        print('\n')
        print('Hey!')
        print('Left.')
        time.sleep(0.24)
        os.system('cls||clear')
        print('Time left:\n00.00.0000 12:00:00')
        print('\n')
        print('Hey!')
        print('Hey!')
        print('Left.')

        time.sleep(0.62)
        os.system('cls||clear')
        print('Time left:\n00.00.0000 12:00:00')
        print('\n')
        print('Hey!')
        print('12...')

        time.sleep(0.32)
        os.system('cls||clear')
        print('Time left:\n00.00.0000 12:00:00')
        print('\n')
        print('Hey!')
        print('Hours...')
        
        time.sleep(0.40)
        os.system('cls||clear')
        print('Time left:\n00.00.0000 12:00:00')
        print('\n')
        print('Hey!')
        print('Hey!')
        print('Left.')
        time.sleep(0.24)
        os.system('cls||clear')
        print('Time left:\n00.00.0000 12:00:00')
        print('\n')
        print('Hey!')
        print('Hey!')
        print('Left.')

        time.sleep(0.62)
        os.system('cls||clear')
        print('Time left:\n00.00.0000 12:00:00')
        print('\n')
        print('Hey!')
        print('12...')

        time.sleep(0.32)
        os.system('cls||clear')
        print('Time left:\n00.00.0000 12:00:00')
        print('\n')
        print('Hey!')
        print('Hours...')
        
        time.sleep(0.40)
        os.system('cls||clear')
        print('Time left:\n00.00.0000 12:00:00')
        print('\n')
        print('Hey!')
        print('Hey!')
        print('Left.')
        time.sleep(0.24)
        os.system('cls||clear')
        print('Time left:\n00.00.0000 12:00:00')
        print('\n')
        print('Hey!')
        print('Hey!')
        print('Left.')

        time.sleep(0.62)
        os.system('cls||clear')
        print('Time left:\n00.00.0000 12:00:00')
        print('\n')
        print('Hey!')
        print('12...')

        time.sleep(0.32)
        os.system('cls||clear')
        print('Time left:\n00.00.0000 12:00:00')
        print('\n')
        print('Hey!')
        print('Hours...')
        
        time.sleep(0.40)
        os.system('cls||clear')
        print('Time left:\n00.00.0000 12:00:00')
        print('\n')
        print('Hey!')
        print('Hey!')
        print('Left.')
        time.sleep(0.24)
        os.system('cls||clear')
        print('Time left:\n00.00.0000 12:00:00')
        print('\n')
        print('Hey!')
        print('Hey!')
        print('Left.')

        time.sleep(0.62)
        os.system('cls||clear')
        print('Time left:\n00.00.0000 12:00:00')
        print('\n')
        print('Hey!')
        print('12...')

        time.sleep(0.32)
        os.system('cls||clear')
        print('Time left:\n00.00.0000 12:00:00')
        print('\n')
        print('Hey!')
        print('Hours...')
        
        time.sleep(0.40)
        os.system('cls||clear')
        print('Time left:\n00.00.0000 12:00:00')
        print('\n')
        print('Hey!')
        print('Hey!')
        print('Left.')
        time.sleep(0.24)
        os.system('cls||clear')
        print('Time left:\n00.00.0000 12:00:00')
        print('\n')
        print('Hey!')
        print('Hey!')
        print('Left.')

        time.sleep(0.62)
        os.system('cls||clear')
        print('Time left:\n00.00.0000 12:00:00')
        print('\n')
        print('Hey!')
        print('12...')

        time.sleep(0.32)
        os.system('cls||clear')
        print('Time left:\n00.00.0000 12:00:00')
        print('\n')
        print('Hey!')
        print('Hours...')
        
        time.sleep(0.40)
        os.system('cls||clear')
        print('Time left:\n00.00.0000 12:00:00')
        print('\n')
        print('Hey!')
        print('Hey!')
        print('Left.')
        time.sleep(0.24)
        os.system('cls||clear')
        print('Time left:\n00.00.0000 12:00:00')
        print('\n')
        print('Hey!')
        print('Hey!')
        print('Left.')

        time.sleep(100)

    
    time.sleep(1)